Revit 2017 API
ReinforcementSettings.RebarVaryingLengthNumberSuffix Property
 A unique identifier used for a bar within a variable length rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public string RebarVaryingLengthNumberSuffix { get; set; }
Visual Basic
Public Property RebarVaryingLengthNumberSuffix As String
	Get
	Set
Visual C++
public:
property String^ RebarVaryingLengthNumberSuffix {
	String^ get ();
	void set (String^ value);
}
Remarks
 This property is used by the numbering method only when varying rebars are numbered as a whole.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The rebar number suffix is not valid if :
Input is empty.
Input contains non-alphanumeric characters.
Input contains both numeric and alphabetic characters.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace